In [1]:
import pandas as pd
import datetime

In [3]:
data = pd.read_csv('Time series Data/time_series.csv')
data.head()

   ID          Datetime  Count
0   0  25-08-2012 00:00      8
1   1  25-08-2012 01:00      2
2   2  25-08-2012 02:00      6
3   3  25-08-2012 03:00      2
4   4  25-08-2012 04:00      2

In [10]:
data.dtypes

ID           int64
Datetime    object
Count        int64
dtype: object

In [11]:
data['Datetime'] = pd.to_datetime(data.Datetime)

In [12]:
data.Datetime.apply(lambda x: x.day_name())

0        Saturday
1        Saturday
2        Saturday
3        Saturday
4        Saturday
           ...
18283    Thursday
18284    Thursday
18285    Thursday
18286    Thursday
18287    Thursday
Name: Datetime, Length: 18288, dtype: object

In [13]:
data.Datetime.apply(lambda x : x.month_name())

0           August
1           August
2           August
3           August
4           August
           ...
18283    September
18284    September
18285    September
18286    September
18287    September
Name: Datetime, Length: 18288, dtype: object

# another datafile with time series data

In [14]:
data2 = pd.read_csv('Time series Data/time_series_2.csv')

In [15]:
data2.head()
#since this particular datasets is in the abbreviated data

   ID      Datetime  Count
0   0  25 Aug 2012       8
1   1  25 Aug 2012       2
2   2  25 Aug 2012       6
3   3  25 Aug 2012       2
4   4  25 Aug 2012       2

In [17]:
data['Datetime'] = pd.to_datetime(data.Datetime, format = '%d %b %Y')

In [18]:
data.dtypes

ID                   int64
Datetime    datetime64[ns]
Count                int64
dtype: object

In [21]:
data['Dayname'] = data.Datetime.dt.day_name()

In [22]:
data['monthname'] = data.Datetime.dt.month_name()

In [23]:
data.head()

   ID            Datetime  Count   Dayname monthname
0   0 2012-08-25 00:00:00      8  Saturday    August
1   1 2012-08-25 01:00:00      2  Saturday    August
2   2 2012-08-25 02:00:00      6  Saturday    August
3   3 2012-08-25 03:00:00      2  Saturday    August
4   4 2012-08-25 04:00:00      2  Saturday    August

In [24]:
#create features like day_name, day_of_week, day_of_year
data['dayofweek'] = data.Datetime.dt.dayofweek
data['dayofyear'] = data.Datetime.dt.dayofyear

In [25]:
data.head()

   ID            Datetime  Count   Dayname monthname  dayofweek  dayofyear
0   0 2012-08-25 00:00:00      8  Saturday    August          5        238
1   1 2012-08-25 01:00:00      2  Saturday    August          5        238
2   2 2012-08-25 02:00:00      6  Saturday    August          5        238
3   3 2012-08-25 03:00:00      2  Saturday    August          5        238
4   4 2012-08-25 04:00:00      2  Saturday    August          5        238

In [26]:
datetime.date.today()

datetime.date(2021, 8, 7)

In [28]:
data['today'] = pd.to_datetime(datetime.date.today())

In [29]:
data.head()

,ID,Datetime,Count,Dayname,monthname,dayofweek,dayofyear,today
0,0,2012-08-25 00:00:00,8,Saturday,August,5,238,2021-08-07
1,1,2012-08-25 01:00:00,2,Saturday,August,5,238,2021-08-07
2,2,2012-08-25 02:00:00,6,Saturday,August,5,238,2021-08-07
3,3,2012-08-25 03:00:00,2,Saturday,August,5,238,2021-08-07
4,4,2012-08-25 04:00:00,2,Saturday,August,5,238,2021-08-07

In [32]:
difference = data.today - data.Datetime

In [33]:
difference

0       3269 days 00:00:00
1       3268 days 23:00:00
2       3268 days 22:00:00
3       3268 days 21:00:00
4       3268 days 20:00:00
               ...
18283   2507 days 05:00:00
18284   2507 days 04:00:00
18285   2507 days 03:00:00
18286   2507 days 02:00:00
18287   2507 days 01:00:00
Length: 18288, dtype: timedelta64[ns]

In [35]:
difference.apply(lambda x: x.days)

0        3269
1        3268
2        3268
3        3268
4        3268
         ...
18283    2507
18284    2507
18285    2507
18286    2507
18287    2507
Length: 18288, dtype: int64

In [37]:
data['difference_dates'] = difference.apply(lambda x: x.days)

In [38]:
data.head()

,ID,Datetime,Count,Dayname,monthname,dayofweek,dayofyear,today,difference_dates
0,0,2012-08-25 00:00:00,8,Saturday,August,5,238,2021-08-07,3269
1,1,2012-08-25 01:00:00,2,Saturday,August,5,238,2021-08-07,3268
2,2,2012-08-25 02:00:00,6,Saturday,August,5,238,2021-08-07,3268
3,3,2012-08-25 03:00:00,2,Saturday,August,5,238,2021-08-07,3268
4,4,2012-08-25 04:00:00,2,Saturday,August,5,238,2021-08-07,3268

In [39]:
#dealing with time zones
data['asiatime'] = data.Datetime.dt.tz_localize('Asia/Calcutta')

In [40]:
data.head()

,ID,Datetime,Count,Dayname,monthname,dayofweek,dayofyear,today,difference_dates,asiatime
0,0,2012-08-25 00:00:00,8,Saturday,August,5,238,2021-08-07,3269,2012-08-25 00:00:00+05:30
1,1,2012-08-25 01:00:00,2,Saturday,August,5,238,2021-08-07,3268,2012-08-25 01:00:00+05:30
2,2,2012-08-25 02:00:00,6,Saturday,August,5,238,2021-08-07,3268,2012-08-25 02:00:00+05:30
3,3,2012-08-25 03:00:00,2,Saturday,August,5,238,2021-08-07,3268,2012-08-25 03:00:00+05:30
4,4,2012-08-25 04:00:00,2,Saturday,August,5,238,2021-08-07,3268,2012-08-25 04:00:00+05:30

In [42]:
data['utctime'] = data.asiatime.dt.tz_convert('UTC')
#to convert the time zone use tz_convert
#to set as local tz_localize

In [43]:
#reading data with unix timestamp
unix_time = pd.read_csv('Time series Data/data_with_timestamp.csv')

In [44]:
unix_time.head()

   ID   timestamp  Count
0   0  1345852800      8
1   1  1345856400      2
2   2  1345860000      6
3   3  1345863600      2
4   4  1345867200      2

In [46]:
unix_time.timestamp = pd.to_datetime(unix_time.timestamp, unit = 's')

In [47]:
unix_time.head()

   ID           timestamp  Count
0   0 2012-08-25 00:00:00      8
1   1 2012-08-25 01:00:00      2
2   2 2012-08-25 02:00:00      6
3   3 2012-08-25 03:00:00      2
4   4 2012-08-25 04:00:00      2

In [48]:
unix_time.dtypes

ID                    int64
timestamp    datetime64[ns]
Count                 int64
dtype: object